Revit 2027 API
ClassificationEntries Class
 A collection of ClassificationEntry objects that make up the classification table.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntries
 Autodesk.Revit.DB.ClassificationEntries
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ClassificationEntries : KeyBasedTreeEntries
Public Class ClassificationEntries
	Inherits KeyBasedTreeEntries
public ref class ClassificationEntries : public KeyBasedTreeEntries
type ClassificationEntries =
    class
        inherit KeyBasedTreeEntries
    end
The ClassificationEntries type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from KeyBasedTreeEntries)
Top
Methods
Name | Description
Dispose
(Inherited from KeyBasedTreeEntries)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
FindEntry |  Finds the KeyBasedTreeEntry associated with the given key value.
(Inherited from KeyBasedTreeEntries)
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
(Inherited from KeyBasedTreeEntries)
GetEnumerator | Returns an enumerator that iterates through a collection.
(Inherited from KeyBasedTreeEntries)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetKeyBasedTreeEntriesIterator |  Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
(Inherited from KeyBasedTreeEntries)
GetType | Gets the Type of the current instance.
(Inherited from Object)
LoadClassificationEntriesFromFile |  Loads the contents of a classification text file into the provided KeyBasedTreeEntriesLoadContent.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace